app/controllers/orders_controller.rb

  def update
    if current_user.role == "charity"
      @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]