app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "orders" ("order_status", "food_description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_status", "open"], ["food_description", ""], ["created_at", "2018-02-01 16:38:27.941874"], ["updated_at", "2018-02-01 16:38:27.941874"]]
SELECT  "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]
---
  def create
    @order = Order.new(order_params)
    @order.order_update = "open"
    @user = User.find_by(params[:id])

    if @order.save
      @user.orders << @order

SELECT  "orders".* FROM "orders" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def update
    @order = Order.find_by(params[:id])